docs/posts/2019-06-05-cancer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cancer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Cancer</h1>
<p class="subtitle" role="doc-subtitle">Jun 05, 2019</p>
</header><p>
In March, I started to notice blood in my urine. At Sheri&rsquo;s insistence, I made an appointment to see our family doctor. After waiting two weeks for approval from the insurance company, I was referred to a urologist, Dr. Archer in Oklahoma City. After another two weeks of waiting for approval, the urologist performed a procedure to see if anything was wrong with the bladder. He noticed tumors, and diagnosed it as an invasive bladder cancer.
</p>

<p>
He then referred me to Dr. Stratton at the Stephenson Cancer Center at OU. Dr. Stratton scheduled the same procedure, since Dr. Archer was not able to go very deep. He told us that the treatment options were dependent on the depth of the tumor. If the tumor extended into the muscle, then the only option is to remove the bladder. If not, then the cancer is treated with BCG, the vaccine for tuberculosis.
</p>

<p>
The results were good – I do not now need to have the bladder removed, and I have been admitted to a clinical trial of BCG. My first treatment is on Thursday, June 6.
</p>



<div class="tagline" id="org5b49ab7">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
